# 11. Поиск уникальных элементов
def unique_elements(lst):
    return list(set(lst))

print("Уникальные элементы:", unique_elements([1, 2, 2, 3, 4, 4, 5]))

# Задача
